docs/leets/0518-Coin-Change-II.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0518. Coin Change II</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-08-23
</div>
<div id="content" class="content">
<header>
<h1 class="title">0518. Coin Change II</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7f74cde">Problem</a>
<ul>
<li><a href="#org07fad9e">Solution Description</a></li>
<li><a href="#org477e483">Example</a></li>
<li><a href="#org2252173">References</a></li>
<li><a href="#org573920a">Solution</a></li>
</ul>
</li>
<li><a href="#org8c01f2d">Results</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org7f74cde" class="outline-2">
<h2 id="org7f74cde">Problem</h2>
<div class="outline-text-2" id="text-org7f74cde">
<p>
We are given an array of distinct integers <code>coins</code> and an integer <code>amount</code>. Our task is to return the number of combinations that make up that amount. If that amount of money cannot be made up by any combination of the coins, return 0. Assume that we have an infinite number of each kind of coin.
</p>
</div>

<div id="outline-container-org07fad9e" class="outline-3">
<h3 id="org07fad9e">Solution Description</h3>
<div class="outline-text-3" id="text-org07fad9e">
<p>
To implement the solution, we need to use a dynamic programming (DP) approach. We will create an array <code>dp</code> where <code>dp[i]</code> represents the number of ways to make the amount <code>i</code> using the given coins. We will initialize =dp[0] to 1 because there is one way to make the amount 0 (with no coins).
</p>

<p>
For each coin, we iterate through all amounts from the value of the coin up to <code>amount</code>. For each amount <code>i</code>, we add the number of ways to make <code>i - coin</code> to <code>dp[i]</code>. This process ensures that we count all combinations that can make up the amount.
</p>

<p>
This solution has a time complexity of <code>O(n * amount)</code> where <code>n</code> is the number of coins, and a space complexity of <code>O(amount)</code> due to the extra array used.
</p>
</div>
</div>

<div id="outline-container-org477e483" class="outline-3">
<h3 id="org477e483">Example</h3>
<div class="outline-text-3" id="text-org477e483">
<p>
Given <code>coins = [1, 2, 5]</code> and <code>amount = 5</code>.
</p>

<ul class="org-ul">
<li>We initialize our dp array: [1, 0, 0, 0, 0, 0]</li>
<li>Using coin 1:
dp: [1, 1, 1, 1, 1, 1]</li>
<li>Using coin 2:
dp: [1, 1, 2, 2, 3, 3]</li>
<li>Using coin 5:
dp: [1, 1, 2, 2, 3, 4]</li>
</ul>

<p>
The number of ways to make the amount 5 is 4.
</p>
</div>
</div>

<div id="outline-container-org2252173" class="outline-3">
<h3 id="org2252173">References</h3>
<div class="outline-text-3" id="text-org2252173">
<ul class="org-ul">
<li>Dynamic Programming: <a href="https://en.wikipedia.org/wiki/Dynamic_programming">Dynamic Programming - Wikipedia</a></li>
<li>LeetCode Problem: <a href="https://leetcode.com/problems/coin-change-ii/">LeetCode Coin Change II</a></li>
<li><a href="https://www.youtube.com/watch?v=oBt53YbR9Kk">2024-08-24 Dynamic Programming - Learn to Solve Algorithmic Problems &amp; Coding Challenges - YouTube</a> <code>www.youtube.com</code></li>
</ul>
<blockquote>
<p>
4,260,987 views  Dec 3, 2020
Learn how to use Dynamic Programming in this course for beginners. It can help you solve complex programming problems, such as those often seen in programming interview questions about data structures and algorithms.
</p>

<p>
This course was developed by Alvin Zablan from Coderbyte. Coderbyte is one of the top websites for technical interview prep and coding challenges.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org573920a" class="outline-3">
<h3 id="org573920a">Solution</h3>
<div class="outline-text-3" id="text-org573920a">
<ul class="org-ul">
<li><a href="https://leetcode.com/submissions/detail/1366207757/">2024-08-24 Coin Change II - Submission Detail - LeetCode</a> <code>leetcode.com</code></li>
</ul>


<p>
We will implement the described solution using modern JavaScript.
</p>

<div class="org-src-container">
<pre class="src src-js">
/**
 * @param {number[]} coins - Array of distinct integers representing coin denominations
 * @param {number} amount - Integer representing the total amount of money
 * @returns {number} - Number of combinations that make up the amount
 */
function coinChangeII(coins, amount) {
    // Helper function for structured logging
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger!== 'undefined' ? () =&gt; {} : console.table;

    const dp = new Array(amount + 1).fill(0);
    dp[0] = 1;

    log(`coins = [${coins}]; amount='${amount}'`);

    log(`Initial dp:`);
    table(dp);
    for (const coin of coins) {
        for (let i = coin; i &lt;= amount; i++) {
            log(`==[ Ittr coin='${coin}'; i='${i}'`);
            log(`==[ dp before: += dp[i - coin] (${dp[i - coin]})`)
            table(dp);

            dp[i] += dp[i - coin];
            log(`==] dp after: += dp[i - coin] (${dp[i - coin]})`)
            table(dp);
        }
    }

    log(`Final dp. dp[amount] == '${dp[amount]}'`);
    table(dp);

    return dp[amount];
}

// Test cases
const testCases = [
    { coins: [1, 2, 5], amount: 5, expected: 4 },
    { coins: [2], amount: 3, expected: 0 },
    { coins: [10], amount: 10, expected: 1 },
    { coins: [1, 2, 3], amount: 4, expected: 4 },
    { coins: [1], amount: 0, expected: 1 }
];

testCases.forEach((test, index) =&gt; {
    const result = coinChangeII(test.coins, test.amount);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
