src/leets/0518-Coin-Change-II.org
* Results
#+begin_example
coins = [1,2,5]; amount='5'
Initial dp:
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='1'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='2'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='3'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 0      │
│ 5       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='4'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 0      │
│ 5       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 1      │
│ 5       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='5'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 1      │
│ 5       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 1      │
│ 5       │ 1      │
└─────────┴────────┘
==[ Ittr coin='2'; i='2'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 1      │
│ 5       │ 1      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 1      │
│ 4       │ 1      │
│ 5       │ 1      │
└─────────┴────────┘
==[ Ittr coin='2'; i='3'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 1      │
│ 4       │ 1      │
│ 5       │ 1      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 1      │
│ 5       │ 1      │
└─────────┴────────┘
==[ Ittr coin='2'; i='4'
==[ dp before: += dp[i - coin] (2)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 1      │
│ 5       │ 1      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (2)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 3      │
│ 5       │ 1      │
└─────────┴────────┘
==[ Ittr coin='2'; i='5'
==[ dp before: += dp[i - coin] (2)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 3      │
│ 5       │ 1      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (2)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 3      │
│ 5       │ 3      │
└─────────┴────────┘
==[ Ittr coin='5'; i='5'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 3      │
│ 5       │ 3      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 3      │
│ 5       │ 4      │
└─────────┴────────┘
Final dp. dp[amount] == '4'
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 3      │
│ 5       │ 4      │
└─────────┴────────┘
Test Case 1: Passed (Expected: 4, Got: 4)
coins = [2]; amount='3'
Initial dp:
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
└─────────┴────────┘
==[ Ittr coin='2'; i='2'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 1      │
│ 3       │ 0      │
└─────────┴────────┘
==[ Ittr coin='2'; i='3'
==[ dp before: += dp[i - coin] (0)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 1      │
│ 3       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (0)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 1      │
│ 3       │ 0      │
└─────────┴────────┘
Final dp. dp[amount] == '0'
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 1      │
│ 3       │ 0      │
└─────────┴────────┘
Test Case 2: Passed (Expected: 0, Got: 0)
coins = [10]; amount='10'
Initial dp:
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
│ 6       │ 0      │
│ 7       │ 0      │
│ 8       │ 0      │
│ 9       │ 0      │
│ 10      │ 0      │
└─────────┴────────┘
==[ Ittr coin='10'; i='10'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
│ 6       │ 0      │
│ 7       │ 0      │
│ 8       │ 0      │
│ 9       │ 0      │
│ 10      │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
│ 6       │ 0      │
│ 7       │ 0      │
│ 8       │ 0      │
│ 9       │ 0      │
│ 10      │ 1      │
└─────────┴────────┘
Final dp. dp[amount] == '1'
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
│ 5       │ 0      │
│ 6       │ 0      │
│ 7       │ 0      │
│ 8       │ 0      │
│ 9       │ 0      │
│ 10      │ 1      │
└─────────┴────────┘
Test Case 3: Passed (Expected: 1, Got: 1)
coins = [1,2,3]; amount='4'
Initial dp:
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='1'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 0      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='2'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 0      │
│ 3       │ 0      │
│ 4       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 0      │
│ 4       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='3'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 0      │
│ 4       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 0      │
└─────────┴────────┘
==[ Ittr coin='1'; i='4'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 0      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 1      │
└─────────┴────────┘
==[ Ittr coin='2'; i='2'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 1      │
│ 3       │ 1      │
│ 4       │ 1      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 1      │
│ 4       │ 1      │
└─────────┴────────┘
==[ Ittr coin='2'; i='3'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 1      │
│ 4       │ 1      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 1      │
└─────────┴────────┘
==[ Ittr coin='2'; i='4'
==[ dp before: += dp[i - coin] (2)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 1      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (2)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 3      │
└─────────┴────────┘
==[ Ittr coin='3'; i='3'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 2      │
│ 4       │ 3      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 3      │
│ 4       │ 3      │
└─────────┴────────┘
==[ Ittr coin='3'; i='4'
==[ dp before: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 3      │
│ 4       │ 3      │
└─────────┴────────┘
==] dp after: += dp[i - coin] (1)
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 3      │
│ 4       │ 4      │
└─────────┴────────┘
Final dp. dp[amount] == '4'
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
│ 1       │ 1      │
│ 2       │ 2      │
│ 3       │ 3      │
│ 4       │ 4      │
└─────────┴────────┘
Test Case 4: Passed (Expected: 4, Got: 4)
coins = [1]; amount='0'
Initial dp:
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
└─────────┴────────┘
Final dp. dp[amount] == '1'
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 1      │
└─────────┴────────┘
Test Case 5: Passed (Expected: 1, Got: 1)
undefined
#+end_example
